[
  {
    "id": "aurora-logistics",
    "title": "Aurora Logistics",
    "category": "SaaS / Optimización",
    "description": "Panel interno para gestionar inventario, tiempos y reportes operativos.",
    "summary": "Un hub operativo con foco en métricas, reportes automáticos y seguimiento de flotas.",
    "highlights": [
      "Dashboard en tiempo real con KPIs de inventario.",
      "Alertas automáticas para tiempos críticos.",
      "Reportes descargables para equipos internos."
    ],
    "details": [
      "El equipo necesitaba un panel operativo que redujera tiempos de respuesta y ordenara flujos de inventario.",
      "Se diseñó una interfaz modular con reportes descargables y alertas configurables para operaciones críticas."
    ],
    "imageKey": "aurora"
  },
  {
    "id": "vanguard-realty",
    "title": "Vanguard Realty",
    "category": "Real Estate / Web",
    "description": "Sitio informativo con catálogo de propiedades y formularios de contacto.",
    "summary": "Experiencia responsive con fichas de propiedades, filtros avanzados y contacto directo.",
    "highlights": [
      "Ficha de propiedad con galería multimedia.",
      "Formularios segmentados por tipo de cliente.",
      "Optimización SEO para búsquedas locales."
    ],
    "details": [
      "El sitio fue pensado para destacar propiedades premium con una navegación clara y llamadas a la acción directas.",
      "Se priorizó la performance en móvil para mejorar la captación de leads desde búsquedas locales."
    ],
    "imageKey": "vanguard"
  },
  {
    "id": "magia-encapsulada",
    "title": "Magia Encapsulada",
    "category": "E-commerce / Full Stack",
    "description": "Plataforma e-commerce full stack con checkout, dashboard y control total de pedidos.",
    "summary": "E-commerce customizado para una marca artesanal con catálogo dinámico, pagos seguros y panel administrativo.",
    "highlights": [
      "Checkout y pagos seguros con Stripe.",
      "Dashboard con gestión de productos y pedidos.",
      "Arquitectura event-driven con Inngest.",
      "Autenticación y roles con Clerk."
    ],
    "details": [
      "Proyecto full-stack desarrollado desde cero para una marca artesanal con alcance global y un flujo de compra completo.",
      "Incluye administración de productos, pedidos y contenido sin depender de terceros, con foco en escalabilidad y seguridad.",
      "La experiencia de usuario prioriza velocidad, SEO y una interfaz clara tanto para compradores como para administradores."
    ],
    "techStack": [
      "Next.js",
      "Tailwind CSS",
      "MongoDB",
      "Stripe",
      "Clerk",
      "Inngest"
    ],
    "demoUrl": "https://magia-encapsulada.vercel.app/",
    "imageKey": "magiaHero",
    "galleryKeys": [
      "magiaHome",
      "magiaProduct",
      "magiaDashboardCreate",
      "magiaDashboardList",
      "magiaShipping",
      "magiaCart",
      "magiaOrdersBuyer",
      "magiaOrdersAdmin"
    ]
  }
]
