[
  {
    "id": "magia-encapsulada",
    "title": "Magia Encapsulada",
    "category": "E-commerce / Full Stack",
    "description": "Plataforma e-commerce full stack con checkout, dashboard y control total de pedidos.",
    "summary": "E-commerce customizado para una marca artesanal con catálogo dinámico, pagos seguros y panel administrativo.",
    "highlights": [
      "Checkout y pagos seguros con Stripe.",
      "Dashboard con gestión de productos y pedidos.",
      "Arquitectura event-driven con Inngest.",
      "Autenticación y roles con Clerk."
    ],
    "details": [
      "Proyecto full-stack desarrollado desde cero para una marca artesanal con alcance global y un flujo de compra completo.",
      "Incluye administración de productos, pedidos y contenido sin depender de terceros, con foco en escalabilidad y seguridad.",
      "La experiencia de usuario prioriza velocidad, SEO y una interfaz clara tanto para compradores como para administradores."
    ],
    "techStack": [
      "Next.js",
      "Tailwind CSS",
      "MongoDB",
      "Stripe",
      "Clerk",
      "Inngest"
    ],
    "demoUrl": "https://magia-encapsulada.vercel.app/",
    "imageKey": "magiaHero",
    "galleryKeys": [
      "magiaHome",
      "magiaProduct",
      "magiaDashboardCreate",
      "magiaDashboardList",
      "magiaShipping",
      "magiaCart",
      "magiaOrdersBuyer",
      "magiaOrdersAdmin"
    ]
  },
  {
    "id": "legalguard-ai",
    "title": "LegalGuard AI",
    "category": "LegalTech / IA",
    "description": "Plataforma de auditoría legal inteligente con RAG, gestión documental y chat técnico sobre PDFs.",
    "summary": "Solución para análisis legal asistido por IA con enfoque en privacidad y procesamiento local de documentos.",
    "highlights": [
      "Indexación de PDFs y consulta técnica contextual.",
      "Motor RAG con Gemini AI para respuestas sobre documentos cargados.",
      "Persistencia local con IndexedDB para proteger información sensible.",
      "Interfaz profesional con monitoreo de actividad en tiempo real."
    ],
    "details": [
      "LegalGuard AI está orientado a equipos legales que necesitan auditar contratos y documentación de forma rápida y segura.",
      "La extracción e indexación de contenido sucede del lado del cliente para minimizar riesgos de exposición de datos.",
      "Incluye una experiencia de chat técnico con contexto documental y una base sólida para escalar autenticación empresarial."
    ],
    "techStack": [
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Gemini AI",
      "PDF.js",
      "IndexedDB"
    ],
    "imageKey": "legalGuardHero",
    "galleryKeys": [
      "legalGuardLogin",
      "legalGuardMain",
      "legalGuardChat"
    ]
  },
  {
    "id": "gtg-landing",
    "title": "GTG.ar Landing",
    "category": "Finanzas / Landing Corporativa",
    "description": "Landing institucional SEO-first para servicios financieros, desarrollada 100% a medida.",
    "summary": "Sitio corporativo orientado a posicionamiento orgánico, cumplimiento comunicacional y captación de leads.",
    "highlights": [
      "Arquitectura component-driven sin plantillas.",
      "Estrategia SEO-first desde el diseño de contenido.",
      "Estructura alineada a comunicación institucional financiera.",
      "Optimización de rendimiento y experiencia responsive."
    ],
    "details": [
      "Proyecto diseñado y construido desde cero para una empresa del sector financiero con necesidades de presencia institucional sólida.",
      "Cada sección fue modularizada para facilitar escalabilidad, mantenimiento y futuras integraciones de CMS.",
      "Se priorizaron performance, claridad de mensajes y accesibilidad de información legal en la experiencia del usuario."
    ],
    "techStack": [
      "Next.js",
      "TypeScript",
      "Tailwind CSS",
      "Anime.js"
    ],
    "demoUrl": "https://gtg.ar/",
    "imageKey": "gtgHero",
    "galleryKeys": [
      "gtgLongCapture"
    ]
  },
  {
    "id": "whos-that-pokemon",
    "title": "Who's that Pokémon?",
    "category": "Game / Frontend",
    "description": "Juego interactivo de adivinanza conectado a PokeAPI con modos claro y oscuro.",
    "summary": "Aplicación web tipo trivia con lógica de rondas, validación flexible de respuestas y feedback inmediato.",
    "highlights": [
      "Consumo dinámico de PokeAPI con reintentos automáticos.",
      "Normalización de nombres para respuestas más justas.",
      "Estados de juego claros con feedback visual al instante.",
      "Interfaz responsive con variantes visuales en claro/oscuro."
    ],
    "details": [
      "El proyecto fue pensado para practicar integración con APIs, manejo de estado y experiencia de juego en frontend.",
      "La lógica central se organiza en servicios y hooks para mantener componentes livianos y reutilizables.",
      "Incluye diferentes capturas de la experiencia de usuario tanto en pantalla principal como en la vista de juego."
    ],
    "techStack": [
      "React",
      "TypeScript",
      "Vite",
      "Bootstrap",
      "PokeAPI"
    ],
    "imageKey": "pokeApiHero",
    "galleryKeys": [
      "pokeApiMainDark",
      "pokeApiGameDark",
      "pokeApiMainLight",
      "pokeApiGameLight"
    ]
  }
]
