[
  {
    "id": "gtg-landing",
    "title": "GTG.ar",
    "category": "Corporate Landing / Full Stack",
    "description": "Landing corporativa financiera enfocada en performance, SEO y compliance.",
    "summary": "Sitio institucional creado desde cero para el sector financiero, con arquitectura escalable y estrategia SEO-first.",
    "highlights": [
      "Landing 100% custom sin plantillas ni page builders.",
      "Arquitectura de componentes con Next.js + Tailwind CSS.",
      "Estructura semántica orientada a SEO y Core Web Vitals.",
      "Diseño con enfoque en compliance y comunicación institucional."
    ],
    "details": [
      "Proyecto diseñado para transmitir credibilidad institucional y facilitar la captación de leads dentro de un entorno regulado.",
      "Se implementó una estrategia SEO desde el inicio con jerarquía semántica, performance optimizada y contenido orientado a posicionamiento orgánico.",
      "Cada sección se desarrolló como componente independiente para facilitar mantenimiento y futuras integraciones con CMS."
    ],
    "techStack": [
      "Next.js",
      "TypeScript",
      "Tailwind CSS",
      "Anime.js"
    ],
    "demoUrl": "https://gtg.ar/",
    "imageKey": "gtgHero",
    "galleryKeys": [
      "gtgFullCapture"
    ]
  },
  {
    "id": "legalguard-ai",
    "title": "LegalGuard AI",
    "category": "LegalTech / IA",
    "description": "Asistente legal con IA para auditar documentos y generar respuestas con contexto controlado.",
    "summary": "Plataforma LegalTech enfocada en análisis documental privado, recuperación contextual (RAG) y persistencia local segura.",
    "highlights": [
      "Auditoría legal asistida por IA con contexto de documentos cargados.",
      "Procesamiento local de PDFs en cliente para mayor confidencialidad.",
      "Persistencia en IndexedDB de documentos y sesiones de chat.",
      "Interfaz multilingüe con experiencia moderna tipo dark glassmorphism."
    ],
    "details": [
      "LegalGuard AI fue pensado para equipos legales que necesitan revisar documentación sensible sin exponer archivos completos a servicios externos.",
      "La extracción de texto se realiza en el navegador y solo se envía a la IA el contexto necesario para responder cada consulta.",
      "Incluye módulos de login, panel principal de auditoría y chat especializado para acelerar análisis y toma de decisiones."
    ],
    "techStack": [
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Google Gemini API",
      "IndexedDB",
      "pdf.js"
    ],
    "demoUrl": "https://legalguard.vercel.app/",
    "imageKey": "legalGuardHero",
    "galleryKeys": [
      "legalGuardLogin",
      "legalGuardMain",
      "legalGuardChat"
    ]
  },
  {
    "id": "whos-that-pokemon",
    "title": "¿Quién es ese Pokémon?",
    "category": "Game / Frontend",
    "description": "Juego web en React + TypeScript para adivinar Pokémon con integración a PokeAPI.",
    "summary": "Aplicación interactiva con siluetas, validación de respuestas y estados de juego para practicar arquitectura frontend moderna.",
    "highlights": [
      "Integración con PokeAPI para obtener Pokémon aleatorios.",
      "Custom hook para encapsular la lógica principal del juego.",
      "Manejo explícito de estados: loading, error, acierto y fallo.",
      "Feedback visual con alertas y animación de confetti."
    ],
    "details": [
      "Proyecto enfocado en buenas prácticas de React moderno, separación de responsabilidades y tipado estricto con TypeScript.",
      "La lógica de negocio se desacopla de la UI mediante servicios y hooks personalizados para escalar funcionalidades futuras.",
      "Se implementó normalización robusta de strings para validar respuestas de usuario de forma consistente."
    ],
    "techStack": [
      "React",
      "TypeScript",
      "Vite",
      "Bootstrap",
      "PokeAPI"
    ],
    "imageKey": "pokeHero",
    "galleryKeys": [
      "pokeMainLight",
      "pokeMainDark",
      "pokeGameLight",
      "pokeGameDark"
    ]
  },
  {
    "id": "magia-encapsulada",
    "title": "Magia Encapsulada",
    "category": "E-commerce / Full Stack",
    "description": "Plataforma e-commerce full stack con checkout, dashboard y control total de pedidos.",
    "summary": "E-commerce customizado para una marca artesanal con catálogo dinámico, pagos seguros y panel administrativo.",
    "highlights": [
      "Checkout y pagos seguros con Stripe.",
      "Dashboard con gestión de productos y pedidos.",
      "Arquitectura event-driven con Inngest.",
      "Autenticación y roles con Clerk."
    ],
    "details": [
      "Proyecto full-stack desarrollado desde cero para una marca artesanal con alcance global y un flujo de compra completo.",
      "Incluye administración de productos, pedidos y contenido sin depender de terceros, con foco en escalabilidad y seguridad.",
      "La experiencia de usuario prioriza velocidad, SEO y una interfaz clara tanto para compradores como para administradores."
    ],
    "techStack": [
      "Next.js",
      "Tailwind CSS",
      "MongoDB",
      "Stripe",
      "Clerk",
      "Inngest"
    ],
    "demoUrl": "https://magia-encapsulada.vercel.app/",
    "imageKey": "magiaHero",
    "galleryKeys": [
      "magiaHome",
      "magiaProduct",
      "magiaDashboardCreate",
      "magiaDashboardList",
      "magiaShipping",
      "magiaCart",
      "magiaOrdersBuyer",
      "magiaOrdersAdmin"
    ]
  }
]
